# Ablation variant — see docs/ablations.md. Topology matches HFA-Mamba-B.yaml;
# only the HFRM placement differs. (P3+P4+P5 full model = HFA-Mamba-B.yaml.)
# HFA-Mamba-B — High-Frequency-Aware Mamba for tiny person detection.
# Built directly on the official Mamba-YOLO-B topology (VSSBlock backbone,
# XSSBlock PAFPN), with an independent HFRM on each detection scale (P3/P4/P5)
# inserted *before* Detect. Single-class (person) -> ~15.9M params.
#
# HFRM is channel-agnostic and needs NO parser edit: the Ultralytics/Mamba-YOLO
# parser's default branch records output channels == input channels (HFRM
# preserves them). Its name is registered at runtime by mbyolo_train.py.
# SBL is injected at runtime too (see ultralytics/utils/sbl.py, sbl.yaml).

nc: 1  # number of classes (person)

scales:  # [depth, width, max_channels]
  B: [0.33, 0.50, 1024]  # matches Mamba-YOLO-B; nc=1 -> ~15.9M params

# ---------------- Mamba-YOLO backbone: C3 (P3/8), C4 (P4/16), C5 (P5/32) -----
backbone:
  # [from, repeats, module, args]
  - [-1, 1, SimpleStem, [128, 3]]        # 0-P2/4
  - [-1, 3, VSSBlock, [128]]             # 1
  - [-1, 1, VisionClueMerge, [256]]      # 2  P3/8
  - [-1, 3, VSSBlock, [256]]             # 3
  - [-1, 1, VisionClueMerge, [512]]      # 4  P4/16
  - [-1, 9, VSSBlock, [512]]             # 5
  - [-1, 1, VisionClueMerge, [1024]]     # 6  P5/32
  - [-1, 3, VSSBlock, [1024]]            # 7
  - [-1, 1, SPPF, [1024, 5]]             # 8

# ---------------- Mamba-YOLO PAFPN + HFRM on each detection scale ------------
head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]   # 9
  - [[-1, 5], 1, Concat, [1]]                  # 10  cat backbone P4
  - [-1, 3, XSSBlock, [512]]                   # 11

  - [-1, 1, nn.Upsample, [None, 2, nearest]]   # 12
  - [[-1, 3], 1, Concat, [1]]                  # 13  cat backbone P3
  - [-1, 3, XSSBlock, [256]]                   # 14  P3/8  (small)

  - [-1, 1, Conv, [256, 3, 2]]                 # 15
  - [[-1, 11], 1, Concat, [1]]                 # 16  cat head P4
  - [-1, 3, XSSBlock, [512]]                   # 17  P4/16 (medium)

  - [-1, 1, Conv, [512, 3, 2]]                 # 18
  - [[-1, 8], 1, Concat, [1]]                  # 19  cat head P5
  - [-1, 3, XSSBlock, [1024]]                  # 20  P5/32 (large)
  # Ablation (Table 8): HFRM on P5 only
  - [20, 1, HFRM, [1024, 0.20]]                # 21  HFRM(P5)
  - [[14, 17, 21], 1, Detect, [nc]]            # 22
